package exam;

public class Example08 {
	/*
	 * 스트림 입출력이란?
	 * - 스트림은 연속적인 데이터의 흐름 혹은 데이터를 전송하는 소프트웨어 모듈 
	 * - 자바에서 입출력 스트림은 응용프로그램과 입출력 장치를 연결하는 소프트웨어 
	 * 모듈이다 
	 * - 자바 응용프로그램은 입출력 장치를 직접 제어하는 대신 입출력 스트림 객체와 
	 * 연결하여 쉽게 데이터 입출력을 실행한다. 
	 * 
	 * 입출력 스트림의 특징
	 * - 스트림의 양끝에는 입출력 장치와 자바 응용프로그램이 연결된다 
	 * - 스트림은 단반향이다
	 * - 스트림을 통해 흘러가는 기본 단위는 바이트나 문자이다.
	 * - 스트림은 선입선출(FIFO) 
	 * 
	 * 바이트 스트림 
	 * - 입출력되는 데이터를 단순 바이트로 처리 
	 * - 바이트를 단위로 다루는 스트림이라 스트림에 들어오고 나가는 
	 * 정보를 단순 바이너리로 다루기 때문에 문자든 이미지 바이트든 상관없다 
	 * 예) 바이너리 파일을 읽는 입력 스트림 
	 * 
	 * 문자 스트림
	 * - 문자만 입출력하는 스트림 
	 * 예) 텍스트 파일을 읽는 입력 스트림 
	 */
}
