package exam;

public class Example04 {
	/*
	 * 클래스에서의 타입 변환
	 * - 클래스의 객체 타입변환
	 * - 클래스의 타입 변환도 마찬가지로 자동 형 변환과 강제 형 변환이 있다.
	 * - 클래스의 타입 변환은, 서로 상속관계에 있는 클래스 사이에서만 변환할 수 있다.
	 * 
	 * 클래스의 자동 타입 변환
	 * - 개발자가 직접 명시하지 않아도 자동으로 타입 변환이 일어나는 것을 말함 
	 * - 클래스 자동 타입 변환은 상속 관계에 있는 자식 클래스의 객체를 부모 타입의 
	 * 객체로 변환하는 것을 말한다.
	 * 
	 * 클래스의 강제 타입 변환
	 * - 부모 타입을 자식타입으로 변환시킨다 
	 * - 자바의 규약으로 부모 타입에서 자식 클래스에 멤버에 접근불가 
	 * - 자식 타입이 부모 타입으로 자동 타입 변환하고, 다시 자식 타입으로 변환할 때 사용
	 * - 자식 타입에 선언된 필드와 메소드를 반드시 사용해야 한다면 강제 타입 변환을 하여 
	 * 자식 타입을 다시 변환하고 필드와 메소드를 사용하면 된다.
	 */
}
